import NavigationBar from '@/components/navigation-bar/navigation-bar'
import {View} from '@tarojs/components'

function PrivacyPolicy() {
  return (
    <View className="container">
      <NavigationBar back color="#fff" background="transparent" title="隐私协议" />
      <View
        style={{
          padding: '15px 20px',
          display: 'block',
          background: '#1b1135',
          fontSize: '14px',
          color: '#fff',
          whiteSpace: 'pre-wrap',
        }}
      >
        欢迎您使⽤鸭藏网站及服务！
        <br />
        为使⽤鸭藏网站（以下统称“本网站”）及服务（以下统称“本服务”），您应当阅读并遵守《鸭藏网站许可及服务协议》（以下简称“本协议”），以及《鸭藏服务协议》、《鸭藏隐私保护指引》。本协议是由您与鸭嘴兽（海南）科技有限公司就向您提供本网站及本服务所订⽴的有效合约。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制鸭藏责任的条款、对⽤户权利进⾏限制的条款、约定争议解决⽅式和司法管辖的条款等，以及开通或使⽤某项服务的单独协议。限制、免责条款或者其他涉及您重⼤权益的条款可能以加粗、加下划线等形式提示您重点注意。如果您对本协议内容或⻚⾯提示信息有任何疑问，请先联系客服咨询，以便我们为您解释和说明。
        <br />
        除⾮您已充分阅读、完全理解并接受本协议所有条款，否则您⽆权下载、安装或使⽤本网站和/
        或相关服务。您点击“同意”或您的下载、安装、使⽤、登录等⾏为或者您以其他任何明示或者默示⽅式表示接受本协议的，即视为您已阅读并同意本协议的约束。本协议即在您与鸭藏之间产⽣法律效⼒，成为对双⽅均具有约束⼒的法律⽂件。
        <br />
        任何未满18周岁的未成年⼈均不得注册帐号或使⽤本服务。鸭嘴兽（海南）科技有限公司将依赖您提供的个⼈信息判断⽤户是否为未成年⼈。此外，如果您不具有完全⺠事⾏为能⼒，请在法定监护⼈（以下简称“监护⼈”）的陪同下阅读和判断是否同意本协议。
        <br />
        1.协议的范围
        <br />
        1.1本协议是您与鸭嘴兽（海南）科技有限公司（下称“鸭藏”或“我们”）之间关于您下载、安装、登录本网站，以及使⽤本服务所订⽴的协议。
        <br />
        1.2本协议的内容，包括但不限于以下与本网站和/或本服务相关的协议、规则、规范以及鸭藏可能不断发布的关于本网站和/或本服务的相关协议、规则、规范等内容。前述内容⼀经正式发布，即为本协议不可分割的组成部分，与其构成统⼀整体，您同样应当遵守：
        <br />
        （1）《鸭藏服务协议》；
        <br />
        （2）《鸭藏隐私保护指引》。
        <br />
        1.3鸭藏作为本网站的运营主体以及服务提供⽅，有权不经另⾏通知变更网站运营和/或服务提供主体。变更后的主体将继续按照本协议约定并向您提供服务，上述主体的变更不会影响您本协议项下的权益。
        <br />
        2.本服务说明
        <br />
        2.1鸭藏依托自己研发的区块链的技术服务，通过本网站向您提供访问、分享、购买数字作品（下称“作品”，数字作品是指使⽤区块链技术进⾏唯⼀标识的经数字化的特定作品、艺术品和商品）的入口。作品具有加密性和不可篡改性，即作品元数据中的创作者、创作和上链时间、购买者等信息，⼀经确认则不可篡改。您购买作品后，作为购买者，您的相关信息将写⼊该作品的元数据中，作为您拥有该作品所有权的凭证。
        <br />
        2.2数字作品的具体发⾏⽅和权益规则等信息以活动⻚⾯具体展示为准，请您务必在购买或兑换数字作品前仔细阅读并确认所购买的数字作品的名称、介绍、价格、数量、权益规则及/或其他限制性要求等重要事项，以保护您的权利，并对是否购买作出独⽴决策和判断。
        <br />
        2.3数字作品由相应的发⾏⽅提供。在您实名认证后，您可按照权益规则或⻚⾯提示通过购买、兑换或其他参与⽅式获得数字作品。您独⽴承担与购买、兑换及其他参与活动⾏为相关的⻛险和后果并享有相应的权利。
        <br />
        2.4您理解并同意，数字作品的版权由发⾏⽅或原创作者拥有。除另⾏取得版权权利⼈书⾯同意外，您不得将数字作品的版权⽤于任何商业⽤途。
        <br />
        2.5数字作品的图⽂展示、介绍、创作者等相关信息均有发⾏⽅提供，所有数字藏品的内容和版权由发⾏⽅单独承担责任。
        2.6为了购买作品，您需要⽀付⼀定费⽤，具体收费标准以⻚⾯实际展示为准。您应该通过鸭藏指定的现有⽅式包括但不限于苹果⽀付、微信⽀付以及各⽹银⽀付等或今后鸭藏指定的⽅式⽀付费⽤。您⽀付成功后即视为您与发⾏⽅之间就已⽀付价款部分的订单建⽴了合同关系。因为区块链技术的特性，本服务售出的作品不⽀持七天⽆理由退换。⽀付完成后，除法定情形外，不可进⾏转让或要求退费。
        <br />
        2.7您知晓并同意，鉴于⽹络服务的特殊性，如出现技术升级、服务体系升级、经营策略调整或配合国家重⼤技术、法律法规、政策等变化，鸭藏可能会根据需要更新或调整本网站和/或本服务的内容，甚⾄中⽌、终⽌向您提供全部或部分服务。
        上述⾏为不视为鸭藏违约，您⽆权要求鸭藏承担任何责任。
        <br />
        3.关于本网站
        <br />
        3.1本网站是指鸭藏或其关联公司开发并按照本协议之约定，授权⽤户下载、安装、登录、使⽤的网站。您可以通过⼿机终端以APP的形式使⽤本服务，具体以鸭藏提供的为准。同时，鸭藏会不断丰富您使⽤本服务的终端、形式等。当您使⽤本服务时，您应选择与您的终端、系统等相匹配的本网站版本，否则，您可能⽆法正常使⽤本服务。
        <br />
        3.2鸭藏给予您⼀项个⼈的、不可转让及⾮排他性的许可，以按照本协议及鸭藏其他协议、规则限定的范围和⽅式使⽤本网站及相关服务。您且仅限于您个⼈，可为⾮商业⽬的使⽤。
        <br />
        3.2.1您可以为⾮商业⽬的在单⼀台终端设备上下载、安装、使⽤、登录本网站。
        <br />
        3.2.2您可以制作本网站的⼀个副本，仅⽤作备份。备份副本必须包含原网站中含有的所有著作权信息。
        <br />
        3.2.3本协议未明示授权的其他⼀切权利仍由鸭藏保留，您在⾏使这些权利时须另外取得鸭藏的书⾯许可。鸭藏如果未⾏使前述任何权利，并不构成对该权利的放弃。
        <br />
        3.2.4您理解并同意，出于本服务的业务特性，未经我们书⾯同意，您⽆法向第三⽅转让本协议项下的权利和义务。
        <br />
        3.2.5您理解并同意，在不对您使⽤本服务造成不利影响的前提下，我们可将在本协议项下的权利和义务全部或部分转让给我们的关联⽅⽽⽆需另⾏通知或征得您的同意。
        <br />
        3.2.6您可以直接从本网站的官⽅网站、官⽅应⽤分发平台以及鸭藏授权的第三⽅网站、应⽤分发平台等鸭藏官⽅或鸭藏授权的渠道获取本网站。
        <br />
        3.2.7如果您从未经鸭藏授权的第三⽅获取本网站或与本网站名称相同的安装网站，鸭藏⽆法保证该网站能够正常使⽤，并对因此给您造成的损失不予负责。
        <br />
        3.2.8鸭藏可能为不同的终端、系统等开发不同的网站版本，您应当根据实际情况选择下载合适的版本进⾏安装。
        <br />
        3.2.9下载安装网站后，您需要按照该网站提示的步骤正确安装。为提供更加优质、安全的服务，在本网站安装时，鸭藏可能推荐您安装其他网站，您可以选择安装或不安装。
        <br />
        3.2.10如果您不再需要使⽤本网站或者需要安装新版网站，可以⾃⾏卸载。如果您愿意帮助鸭藏改进产品服务，请告知卸载的原因。
        <br />
        3.2.11为了增进⽤户体验、完善服务内容，鸭藏可能不断努⼒开发新的服务，并为您不时提供网站更新。
        <br />
        3.2.12为了改善⽤户体验或提⾼服务安全性、保证功能的⼀致性等⽬的，鸭藏有权对本网站进⾏更新，或者对本网站的部分功能效果、服务内容进⾏改变。
        <br />
        3.2.13本网站新版本发布后，旧版本的网站可能⽆法使⽤。鸭藏不保证旧版本网站继续可⽤，也不保证继续对旧版本网站提供相应的客服和维护服务，请您随时核对并下载最新版本。
        <br />
        4.服务帐号
        <br />
        4.1您在使⽤本服务前需要使⽤微信号注册帐号（以下或称“帐号”）。鸭藏有权变更本网站帐号申请、使⽤的规则，具体以鸭藏公布为准。
        <br />
        4.2您在注册帐号或使⽤本服务的过程中，可能需要填写⼀些必要的信息。若国家法律法规（本协议中的“法律法规”指⽤户所属/所处地区、国家现⾏有效的法律、⾏政法规、司法解释、地⽅法规、地⽅规章、部⻔规章及其他规范性⽂件以及对于该等法律法规的不时修改和补充，以及相关政策规定等，下同）有特殊规定的，您需要填写真实、准确、合法、有效的身份信息（包括但不限于⼿机号码、身份证件等信息）。若您填写的信息不真实、不准确、不合法、不规范，我们有理由怀疑为错误、不实或不合法的资料，则我们有权拒绝为您提供相关服务或您可能⽆法使⽤本网站及相关服务或在使⽤过程中部分功能受到限制。如果您提供的注册资料不合法、不真实、不准确、不详尽的，您需承担因此引起的相应责任及后果，并且鸭藏保留终⽌您使⽤本服务的权利。
        <br />
        4.3⽤户有义务妥善保管其帐号及密码，并正确、安全地使⽤其帐号及密码，并对您以服务帐号名义所从事的活动承担全部法律责任，包括但不限于您在本网站进⾏的任何⾔论发表、购买、款项⽀付（如有）等操作⾏为。⽤户未尽上述义务导致帐号密码遗失、帐号被盗等情形⽽给⽤户和他⼈的⺠事权利造成损害的，应当⾃⾏承担由此产⽣的法律责任。
        4.4服务帐号的所有权归鸭藏公司所有，⽤户完成申请、注册⼿续后，仅获得该帐号的使⽤权，且该使⽤权仅属于初始申请注册⼈。同时，初始申请注册⼈不得赠与、借⽤、租⽤、转让或售卖帐号或者以其他⽅式许可⾮初始申请注册⼈使⽤帐号。⾮初始申请注册⼈不得通过受赠、继承、承租、受让或者其他任何⽅式使⽤帐号。
        <br />
        4.5您理解并承诺，您所设置的帐号不得违反国家法律法规及本网站使⽤的相关规则。您设置的帐号名称、头像等信息及其他个⼈信息中不得出现违法和不良信息，未经他⼈许可不得⽤他⼈名义（包括但不限于冒⽤他⼈姓名、名称、字号、头像等⾜以让⼈引起混淆的⽅式）开设帐号。您在帐号注册及使⽤过程中需遵守相关法律法规，不得实施任何侵害国家利益、损害其他公⺠合法权益或有害社会道德⻛尚的⾏为。
        <br />
        4.6如需注销帐号，您应审慎阅读并同意《鸭藏网站帐号注销协议》，⽅可提交注销申请。您仅能申请注销您本⼈的帐号，并在本网站内按照要求的流程进⾏注销。注销成功后，帐号涉及的个⼈信息、使⽤记录等将⽆法恢复或提供。
        <br />
        5.引⾔
        <br />
        5.1为了更好地向您提供服务，在您⾸次登陆时，您同意我们在遵循合法、正当、必要原则的前提下在您授权后从第三⽅平台获取您的个⼈信息，包括但不限于⽤户头像、昵称以及ID编号等。如果您不授予前述同意，您可能⽆法正常使⽤本服务。
        5.2在您购买或转赠作品时，根据区块链信息服务以及反洗钱相关要求，您同意我们存储您的⼿机号、身份证件等信息，并授权我们向第三⽅查询您是否通过实名认证状态以及您账户身份核验的验证结果信息。如果您不授予前述同意，您可能⽆法完成购买或转赠数字藏品，但不影响您继续浏览本网站展示的信息。
        <br />
        5.3为了便于您使⽤本服务,您同意我们为开展业务及提供服务所需,在您使⽤服务过程中将前述第5.1条获取的授权信息以及相关业务信息（包括但不限于您的数字藏品的持有数量和转赠数量等）分享给我们的相关关联⽅和合作⽅（为本协议之⽬的,该等合作⽅包括但不限于某⼀特定产品项⽬的IP发⾏⽅、品牌⽅、⽣产⽅、供应⽅、经销⽅、场景提供⽅、和/或其授权的公司），⽤于其在活动⻚⾯上(i)展示信息、或者(ii)向您发放作品并提供相关服务。
        <br />
        5.4鸭藏将严格遵守相关法律法规与监管要求，依法使⽤您的信息，并对您的信息保密。您同意本协议后，上述授权关系将⻓期有效，直⾄您主动解除
        <br />
        6.⽤户个⼈信息保护
        <br />
        6.1保护⽤户个⼈信息是鸭藏的⼀项基本原则，鸭藏将按照本协议及《鸭藏隐私保护指引》的约定收集、使⽤、储存和分享您的个⼈信息。本协议对个⼈信息保护相关内容未作明确规定的，均应以《鸭藏隐私保护指引》的内容为准。
        <br />
        6.2鸭藏不会将您的个⼈信息转移或披露给任何第三⽅，除⾮：
        <br />
        （1）相关法律法规或司法机关、⾏政机关要求；或
        <br />
        （2）为完成合并、分⽴、收购或资产转让⽽转移；或
        <br />
        （3）为提供您要求的服务所必需。
        <br />
        （4）依据《鸭藏隐私保护指引》或其他相关协议规则可以转移或披露给任何第三⽅的情形。
        <br />
        6.3为了更好地向您提供本服务，在获得您的明确同意后，鸭藏可对您服务帐号中的昵称、头像以及在本网站中的相关操作信息（以下称“该等信息”）进⾏使⽤，并可在本网站中向您本⼈或其他⽤户展示该等信息。
        <br />
        6.4您在使⽤本服务某⼀特定功能时，鸭藏在获得您明确同意的前提下可以使⽤您终端设备的相关权限、接⼝及相关信息等以实现相应的功能。您可以选择不向鸭藏提供您的相关权限、接⼝、信息，或者根据产品设置取消鸭藏使⽤相关权限、接⼝或收集某些信息的权利，但因此可能会导致相关服务功能⽆法实现。
        <br />
        6.5您应对通过本网站和/或本服务了解、接收或可接触到的包括但不限于其他⽤户在内的任何⼈的个⼈信息予以充分尊重，您不应以搜集、复制、存储、传播或以其他任何⽅式使⽤其他⽤户的个⼈信息，否则，由此产⽣的后果由您⾃⾏承担。
        <br />
        7.⽤户⾏为规范
        <br />
        7.1⽤户禁⽌⾏为
        <br />
        您在使⽤本网站和/或本服务的过程中，应遵守相关法律法规、本协议、规则、规范等，不得从事包括但不限于以下任何⾏为，也不得为以下任何⾏为提供便利：
        <br />
        7.1.1法律法规禁⽌的⾏为
        <br />
        您在使⽤本服务时须遵守法律法规，不得制作、复制、发布、传播含有下列内容的信息或从事相关⾏为，也不得为制作、复制、发布、传播含有下列内容的信息或从事相关⾏为提供便利：
        <br />
        （1）反对宪法所确定的基本原则的；
        <br />
        （2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统⼀的；
        <br />
        （3）损害国家荣誉和利益的；
        <br />
        （4）煽动⺠族仇恨、⺠族歧视，破坏⺠族团结的；
        <br />
        （5）破坏国家宗教政策，宣扬邪教和封建迷信的；
        <br />
        （6）散布谣⾔，扰乱社会秩序，破坏社会稳定的；
        <br />
        （7）散布淫秽、⾊情、赌博、暴⼒、凶杀、恐怖或者教唆犯罪的；
        <br />
        （8）侮辱或者诽谤他⼈，侵害他⼈合法权益的；
        <br />
        （9）违反法律法规底线、社会主义制度底线、国家利益底线、公⺠合法权益底线、社会公共秩序底线、道德⻛尚底线和信息真实性底线的“七条底线”要求的；
        <br />
        （10）法律法规、本协议或使⽤本网站的其他规则等禁⽌的其他⾏为。
        <br />
        7.1.2网站使⽤
        <br />
        除⾮法律法规允许或鸭藏书⾯许可，您不得从事下列⾏为：
        <br />
        （1）删除本网站及其副本上关于著作权的信息；
        <br />
        （2）对本网站进⾏反向⼯程、反向汇编、反向编译，或者以其他⽅式尝试发现本网站的源代码；
        <br />
        （3）对鸭藏拥有知识产权的内容进⾏使⽤、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建⽴镜像站点等；
        （4）对本网站或者本网站运⾏过程中释放到任何终端内存中的数据、网站运⾏过程中客户端与服务器端的交互数据，以及本网站运⾏所必需的系统数据，进⾏复制、修改、增加、删除、挂接运⾏或创作任何衍⽣作品，形式包括但不限于使⽤插件、外挂或⾮鸭藏经授权的第三⽅⼯具/服务接⼊本网站和相关系统；
        <br />
        （5）通过修改或伪造网站运⾏中的指令、数据，增加、删减、变动网站的功能或运⾏效果，或者将⽤于上述⽤途的网站、⽅法进⾏运营或向公众传播，⽆论这些⾏为是否为商业⽬的；
        <br />
        （6）通过⾮鸭藏开发、授权的第三⽅网站、插件、外挂、系统，登录或使⽤本网站和/或本服务，或制作、发布、传播上述⼯具；
        <br />
        （7）⾃⾏、授权他⼈或利⽤第三⽅网站对本网站和/或本服务及其组件、模块、数据等进⾏⼲扰；
        <br />
        （8）其他可能影响、⼲扰本网站和/或本服务正常运⾏的⾏为。
        <br />
        7.1.3数据获取使⽤
        <br />
        为了保护数据安全，您不得从事包括但不限于以下⾏为，也不得为其提供便利：
        <br />
        （1）未经其他⽤户明确同意，或在未向其他⽤户如实披露数据⽤途、使⽤范围等相关信息的情形下收集、复制、存储、使⽤或传输其他⽤户数据，侵害其他⽤户合法权益；
        <br />
        （2）将其他⽤户的帐号、昵称等个⼈信息⽤于任何未经⽤户及鸭藏授权的⽤途；
        <br />
        （3）企图进⾏反射查找、跟踪、关联、挖掘、获取⽤户帐号、⼿机号和出⽣⽇期等个⼈信息；
        <br />
        （4）通过各种网站、网站等抓取任何⽤户的信息或与本网站和/或本服务相关的任何信息、数据；
        <br />
        （5）未经鸭藏授权使⽤任何第三⽅网站、插件、外挂、系统等查看、获取本网站和/或本服务中所包含的鸭藏、鸭藏合作伙伴或⽤户的任何相关信息、数据等内容。
        <br />
        （6）其他危害数据安全的⾏为。
        <br />
        7.2法律责任
        <br />
        7.2.1您理解并同意：若您违反法律法规、本协议和/或鸭藏其他协议、规则的，鸭藏有权随时单⽅根据相应情形采取以下⼀项或多项措施（具体措施以及采取措施的时间⻓短由鸭藏根据您的违法、违约情节相应情况确定）：
        <br />
        （1）对您进⾏警告；
        <br />
        （2）删除违法违规信息；
        <br />
        （3）限制您使⽤本网站和/或本服务部分或全部功能；
        <br />
        （5）采取其他合理、合法的措施；
        <br />
        （6）依法移交有关⾏政管理机关给予⾏政处罚，或者依法向有关机关报案追究刑事责任。
        <br />
        7.2.2如果您违反法律法规、本协议和/或鸭藏其他协议、规则，鸭藏对您或您使⽤的本网站和/或本服务采取任何⾏为或措施后，导致您暂时或永久⽆法使⽤服务帐号，您应⾃⾏承担相应后果（包括但不限于通信中断、⽤户资料及相关数据的清空或⽆法使⽤等）。由此造成您损失的，您应⾃⾏承担。
        <br />
        7.2.3您导致任何第三⽅损害的，您应当独⽴承担责任；鸭藏因此遭受损失的，您也应当⼀并赔偿。
        <br />
        7.3对⾃⼰⾏为负责
        <br />
        您充分了解并同意，您必须为⾃⼰使⽤本网站和/或本服务的⼀切⾏为负责，包括您所发表的任何内容以及由此产⽣的任何后果。您应对使⽤本网站和/或本服务时接触到的内容⾃⾏加以判断，包括因对内容的正确性、完整性或实⽤性的依赖⽽产⽣的⻛险，并承担由此引起的相应⻛险。鸭藏在法律允许的范围内不对您因前述⻛险⽽导致的任何损失或损害承担责任。
        <br />
        8.知识产权
        <br />
        8.1鸭藏是本网站的知识产权权利⼈。本网站的著作权、商标权、专利权、商业秘密等知识产权，以及与本网站相关的所有信息内容（包括但不限于⽂字、图⽚、⾳频、视频、档案、资讯、资料、图表、界⾯设计、版⾯框架、平台架构、平台画⾯的安排、⽹⻚设计、有关数据或电⼦⽂档等）均受法律法规和相应的国际条约保护，鸭藏依法享有上述相关知识产权，但相关权利⼈依照法律规定应享有的权利除外。
        <br />
        8.2未经鸭藏或相关权利⼈书⾯同意，您不得为任何商业或⾮商业⽬的⾃⾏或许可任何第三⽅实施、利⽤、转让上述知识产权。
        <br />
        8.3您承诺对您通过本网站所上传的内容（包括但不限于⽂字、图⽚、视频、⾳频及/或视频、⾳频中的⾳乐作品、声⾳等）拥有完整著作权或已获得合法授权，未侵犯任何第三⽅之合法权益。
        <br />
        8.4如您发现本网站及相关网站内存在任何侵犯您权利的内容，请⽴即通过邮箱system@platypus.art通知鸭藏，提供您有关权利的初步证据，鸭藏会根据法律法规要求及时处理您的投诉。
        <br />
        9.第三⽅网站或技术
        <br />
        9.1本网站可能会使⽤第三⽅网站或技术（包括本网站可能使⽤的开源代码和公共领域代码等，下同），这种使⽤已经获得合法授权。
        <br />
        9.2本网站如果使⽤了第三⽅的网站或技术，鸭藏将按照相关法规或约定，对相关的协议或其他⽂件，可能通过本协议附件、在本网站安装包特定⽂件夹中打包等形式进⾏展示，它们可能会以“网站使⽤许可协议”“授权协议”“开源代码许可证”或其他形式来表达。
        <br />
        9.3前述相关协议或其他⽂件均是本协议不可分割的组成部分，与本协议具有同等的法律效⼒，您应当遵守这些要求。如果您没有遵守这些要求，该第三⽅或者国家机关可能会对您提起诉讼、罚款或采取其他制裁措施，并要求鸭藏给予协助，您应当⾃⾏承担法律责任。
        <br />
        10.不可抗⼒及其他免责事由
        <br />
        10.1您理解并同意，在使⽤本服务的过程中，可能会遇到不可抗⼒等⻛险因素，使本服务受到影响。不可抗⼒是指不能预⻅、不能克服并不能避免且对⼀⽅或双⽅造成重⼤影响的客观事件，包括但不限于⾃然灾害如洪⽔、地震、瘟疫流⾏和⻛暴等以及社会事件如战争、动乱、政府⾏为等。出现上述情况时，鸭藏将努⼒在第⼀时间与相关单位配合，争取及时进⾏处理，但是由此给您造成的损失，鸭藏在法律允许的范围内免责。
        <br />
        10.2在法律允许的范围内，鸭藏对以下情形导致的服务中断或受阻不承担责任：
        <br />
        （1）受到计算机病毒、⽊⻢或其他恶意网站、⿊客攻击的破坏。
        <br />
        （2）⽤户或鸭藏的电脑网站、系统、硬件和通信线路出现故障及电⼒故障、电信设备故障。
        <br />
        （3）因⽹络拥堵、系统不稳定、第三⽅服务瑕疵等原因。
        <br />
        （4）⽤户操作不当或⽤户通过⾮鸭藏授权或认可的⽅式使⽤本服务。
        <br />
        （5）网站版本过时、设备的⽼化和/或其兼容性问题。
        <br />
        （6）在本服务相关的系统停机维护或升级期间。
        <br />
        （7）其他鸭藏⽆法控制或合理预⻅的情形。
        <br />
        10.3鸭藏将会尽其商业上的合理努⼒保障您在本服务中的数据存储安全，但是，鸭藏并不能就此提供完全保证，包括但不限于以下情形：
        <br />
        （1）鸭藏不对由于⾮鸭藏原因造成的您在本网站和/或本服务中相关数据的删除或储存失败负责。
        <br />
        （2）您应⾃⾏备份存储在本网站和/或本服务中的数据、信息或与本网站和/或本服务相关的数据、信息，双⽅另有约定的按相应约定执⾏。
        <br />
        （3）如果您停⽌使⽤本网站和/或本服务，或因您违反法律法规或本协议⽽被取消或终⽌使⽤本服务，鸭藏有权从服务器上永久地删除您的数据。您的服务停⽌、终⽌或取消后，鸭藏没有义务向您返还任何数据。
        <br />
        10.4您理解并同意，在使⽤本服务的过程中，可能会遇到⽹络信息或其他⽤户⾏为带来的⻛险，鸭藏不对任何信息的真实性、适⽤性、合法性承担责任，也不对因侵权⾏为给您造成的损害负责。这些⻛险包括但不限于：
        <br />
        （1）来⾃他⼈匿名或冒名的含有威胁、诽谤、令⼈反感或⾮法内容的信息。
        <br />
        （2）遭受他⼈误导、欺骗或其他导致或可能导致的任何⼼理、⽣理上的伤害以及经济上的损失。
        <br />
        （3）其他因⽹络信息或⽤户⾏为引起的风险。
        <br />
        10.5您注意勿在使⽤本网站和/或本服务中透露⾃⼰的各类财产账户、银⾏卡、信⽤卡、第三⽅⽀付账户及对应密码等重要资料，否则由此带来的任何损失由您⾃⾏承担。您亦不应将其他个⼈信息通过本平台发表、上传或扩散。
        <br />
        10.6您理解并同意：为了向您提供有效的服务，本网站会利⽤您终端设备的处理器和带宽等资源。本网站使⽤过程中可能产⽣数据流量的费⽤，⽤户需⾃⾏向运营商了解相关资费信息，并⾃⾏承担相关费⽤。
        <br />
        10.7基于⽤户体验、本网站或相关服务的运营安全、规则要求及平台健康发展等综合因素，鸭藏有权选择提供服务的对象，决定功能设置，决定功能开放、数据接⼝和相关数据披露的对象和范围。针对以下情形，鸭藏有权视具体情况中⽌或终⽌提供相关服务，⽽您不会因此追究鸭藏的责任，包括但不限于：
        <br />
        （1）违反法律法规或本协议的；
        <br />
        （2）影响服务体验的；
        <br />
        （3）存在安全隐患的；
        <br />
        （4）违背本网站或本服务运营原则、规范，或不符合鸭藏其他管理要求的；
        <br />
        （5）技术升级、服务体系升级、或因经营策略调整或配合国家重⼤技术、法规政策等变化造成。
        <br />
        10.8鸭藏不成为您与上架或第三⽅之间任何交易或业务的参与⽅，不对所涉及的作品及/或第三⽅服务的质量、安全性及其合法性、真实性、准确性作出任何明示或暗示的保证。
        <br />
        10.9本协议项下涉及的所有作品，由发⾏⽅保证其对作品享有作为权利⼈完整、合法、有效的权利或已取得权利⼈的合法授权，保证有权开展作品⽣成、发⾏、转赠等相适应场景的应⽤活动，并保证其开展上述活动不违反任何法律法规或侵犯第三⽅的合法权益。如因作品发⾏⽅或原创作者侵权、发布危害国家利益、违反公序良俗以及其他可能产⽣负⾯舆论的⾔论或⾏为，或者作品存在权利瑕疵、内容违规、或其他可能产⽣严重负⾯舆论等情形，导致作品被屏蔽或限制使⽤的，您同意我们⽆需承担相关责任，您可以⾃⾏联系发⾏⽅解决，或者您也可以联系客服协调处理。
        <br />
        11.其他
        <br />
        11.1鸭藏有权在必要时修改本协议条款，包括但不限于出于版本升级、功能升级、技术升级、新增、更新或调整服务内容和功能等需要以及根据国家法律法规的变化要求⽽对本协议进⾏的修改。您可以在相关服务⻚⾯查阅最新版本的协议条款。
        11.2除另有说明外，本协议条款变更后，更新的内容将于协议更新公告公布的⽣效之⽇起⽣效。
        <br />
        11.3若您不接受变更后的服务内容或功能，或不同意更新后的协议内容，您需⽴即停⽌使⽤相关服务。若您继续使⽤鸭藏提供的网站或服务，即视为您已同意并接受变更后的协议，并⾃愿接受变更后的协议内容约束。
        <br />
        11.4本协议签订地为中华⼈⺠共和国海南省海口市龙华区世贸中心C栋中税众创空间2302936号。
        <br />
        11.5本协议的成⽴、⽣效、履⾏、解释及纠纷解决，适⽤中华⼈⺠共和国⼤陆地区法律（不包括冲突法）。
        <br />
        11.6若您和鸭藏之间发⽣任何纠纷或争议，⾸先应友好协商解决；协商不成的，您同意将纠纷或争议提交本协议签订地（即海南省海口区）有管辖权的⼈⺠法院管辖。
        <br />
        11.7本协议所有条款的标题仅为阅读⽅便，本身并⽆实际涵义，不能作为本协议涵义解释的依据。
        <br />
        11.8本协议的部分条款⽆论因何种原因部分⽆效或不可执⾏，其余条款仍有效，对双⽅具有约束⼒。
        <br />
      </View>
      <View className="safe-bottom" />
    </View>
  )
}

export default PrivacyPolicy
